In [3]:
import pandas as pd
df = pd.DataFrame({'Names':['Ram','Shyam','Hari','Bikash','Samrat'],
                  'Address':['Kathmandu','Palpa','Pyuthan','Bhaktapur','Patan'],
                  'Age':[21,22,20,19,18]})
df.to_csv('books.csv')
df.head()

    Names    Address  Age
0     Ram  Kathmandu   21
1   Shyam      Palpa   22
2    Hari    Pyuthan   20
3  Bikash  Bhaktapur   19
4  Samrat      Patan   18